#pragma once

#include "SizeKorea.h"

std::vector<std::string> LandmarkPose2 = {
	"머리마루점", // 1
	"방패연골아래점", // 2
	"목앞점", // 3
	"목옆점(오른)", // 4
	"목옆점(왼)", // 5
	"목뒤점", // 6
	"어깨가쪽점(오른)", // 7
	"어깨가쪽점(왼)", // 8
	"겨드랑점(오른)", // 9
	"겨드랑점(왼)", // 10
	"겨드랑앞접힘점(오른)", // 11
	"겨드랑앞접힘점(왼)", // 12
	"젖꼭지점(오른)", // 13
	"젖꼭지점(왼)", // 14
	"젖가슴아래점", // 15
	"허리점(오른)", // 16
	"허리점(왼)", // 17
	"허리앞점", // 18
	"허리뒤점", // 19
	"배돌출점", // 20
	"배꼽점", // 21
	"배꼽뒤점", // 22
	"엉덩이돌출점", // 23
	"샅점", // 24
	"볼기고랑점", // 25
	"무릎뼈가운데점", // 26
	"장딴지돌출점", // 27
	"가쪽복사점", // 28
	"안쪽복사점", // 29
	"손목안쪽점", // 30
	"손목가쪽점", // 31
	"손끝점", // 32
	"팔꿈치가운데점", // 33
	"어깨가운데점", //34
	"미드리프수준점", // 35
	"Upper-hip수준점", // 36
	"Top-hip수준점", // 37
	"넙다리가운데점", // 38
	"무릎뼈아래점", // 39
	"장딴지앞점", // 40
	"종아리아래점", // 41
	"어깨점(오른)", // 42
	"어깨점(왼)" // 43
};

std::vector<std::string> ResultPose2 = {
	"목밑둘레", // 1
	"가슴둘레", // 2
	"젖가슴둘레", // 3
	"젖가슴둘레(체표를 따르는)", // 4
	"젖가슴아래둘레", // 5
	"미드리프둘레", // 6
	"허리둘레", // 7
	"배꼽수준허리둘레", // 8
	"배둘레", // 9
	"Upper-hip둘레", // 10
	"Top-hip둘레", // 11
	"엉덩이둘레(다리벌린)", // 12
	"몸통세로둘레", // 13
	"목밑뒤길이", // 14
	"편위팔둘레", // 15
	"편팔꿈치둘레", //16
	"손목둘레", // 17
	"넙다리둘레", // 18
	"넙다리중간둘레", // 19
	"무릎둘레", // 20
	"무릎아래둘레", // 21
	"장딴지최대둘레", // 22
	"종아리최소둘레", // 23
	"발목최대둘레", // 24
	"목둘레", // 25
	"겨드랑둘레(어깨점)", // 26
	"겨드랑둘레(어깨가쪽점)", // 27
	"가쪽복사수평둘레", // 28
	"장딴지둘레", // 29
	"샅앞길이", // 30
	"샅뒤길이", // 31
	"샅앞뒤길이", // 32
	"배꼽수준샅앞뒤길이", // 33
	"몸통옆길이", // 34
	"목두께", // 35
	"겨드랑두께", // 36
	"가슴두께", // 37
	"가슴두께(정중면)", // 38
	"젖가슴두께", // 39
	"젖가슴아래두께", // 40
	"허리두께", // 41
	"허리두께(정중면)", // 42
	"배꼽수준허리두께", // 43
	"배두께", // 44
	"엉덩이두께", // 45
	"넙다리두께", // 46
	"넙다리중간두께", // 47
	"무릎두께", // 48
	"무릎아래두께", // 49
	"장딴지두께", // 50
	"종아리아래두께", // 51
	"위팔두께", // 52
	"팔꿈치두께", // 53
	"손목두께", // 54
	"목너비",
	"목밑너비",
	"가슴너비",
	"젖가슴너비",
	"젖가슴아래너비",
	"허리너비",
	"배꼽수준허리너비",
	"배너비",
	"엉덩이너비",
	"넙다리너비",
	"넙다리중간너비",
	"무릎너비",
	"무릎아래너비",
	"장딴지너비",
	"종아래아래너비",
	"위팔너비",
	"팔꿈치너비",
	"손목너비",
	"팔안쪽길이",
	"엉덩이옆길이",
	"허리옆가쪽복사길이",
	"다리가쪽길이",
	"몸통세로길이(줄자)",
	"몸통세로길이(체표를 따르는)",
	"젖가슴컵사이즈"
};

